app/views/recipes/edit.erb

    <%= f.text_field :name %>
    <%= f.collection_select(:user_id, User.all, :id, :name) %>
---
SELECT "users".* FROM "users"