app/views/recipes/new.erb

    <%= f.text_field :name %>
    <%= f.collection_select(:user_id, User.all, :id, :name) %><br>
---
SELECT "users".* FROM "users"