app/views/users/show.erb

<li>  <%= @user.name %></li>
<% @user.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 4]]