app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "cheese"], ["created_at", "2019-02-06 21:17:23.512784"], ["updated_at", "2019-02-06 21:17:23.512784"]]
---
  def create
    @ingredient = Ingredient.create(ingredient_params)

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @ingredient = Ingredient.find(params[:id])

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "ingredients" SET "name" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["name", "cheese cheese"], ["updated_at", "2019-02-06 21:17:35.811357"], ["id", 1]]
---
  def update
    @ingredient = Ingredient.find(params[:id])
    @ingredient.update(ingredient_params)