app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "user_id") VALUES (?, ?)  [["name", "pizza b"], ["user_id", 1]]
---
  def create
    # byebug
    @recipe = Recipe.create(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = ? WHERE "recipes"."id" = ?  [["name", "pizza"], ["id", 1]]
---
  def update
    @recipe = Recipe.find(params[:id])
    @recipe.update(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 9]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.delete