app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "bob"], ["created_at", "2019-02-06 21:04:08.440146"], ["updated_at", "2019-02-06 21:04:08.440146"]]
---
  def create
    @user = User.create(user_params)